{"description": [{"excerpt": "The philosophy behind Backstage is simple: Don't expose your engineers to the full complexity of your infrastructure tooling. Engineers should be shipping code — not figuring out a whole new toolset every time they want to implement the basics. Backstage allows you add \"stuff\" (tooling, services, features, etc.) by adding a plugin, instead of building a new tool. This saves you work and avoids the need of your team to learn how to use and support yet another tool. \nFor more information go to backstage.io \n", "confidence": [0.8205390744706886, 0.7217214632012141]}, {"excerpt": "We created Backstage about 4 years ago. While our internal version of Backstage has had the benefit of time to mature and evolve, the first iteration of our open source version is still nascent. We are envisioning three phases of the project and we have already begun work on various aspects of these phases: \n", "confidence": [0.838672783944333]}, {"excerpt": "Phase 2: Manage your stuff (next 2-3 months) - Manage anything from microservices to software components to infrastructure and your service catalog. Regardless of whether you want to create a new library, view service deployment status in Kubernetes, or check the test coverage for a website -- Backstage will provide all of those tools - and many more - in a single developer portal. \nPhase 3: Ecosystem (later) - Everyone's infrastructure stack is different. By fostering a vibrant community of contributors we hope to provide an ecosystem of Open Source plugins/integrations that allows you to pick the tools that match your stack. \n", "confidence": [0.7469781280521582, 0.7425081027464228]}, {"excerpt": "Our vision for Backstage is for it to become the trusted standard toolbox (read: UX layer) for the open source infrastructure landscape. Think of it like Kubernetes for developer experience. We realize this is an ambitious goal. We can’t do it alone. If this sounds interesting or you'd like to help us shape our product vision, we'd love to talk. You can email me directly: alund@spotify.com. \n", "confidence": [0.8084030917942319]}, {"excerpt": "The Backstage platform consists of a number of different components: \nfrontend - Main web application that users interact with. It's built up by a number of different Plugins. \nplugins - Each plugin is treated as a self-contained web app and can include almost any type of content. Plugins all use a common set of platform API's and reusable UI components. Plugins can fetch data either from the backend or through any RESTful API exposed through the proxy. \n", "confidence": [0.7205115186276421, 0.7075209483057409, 0.7463075767321727]}, {"excerpt": "The final yarn start command should open a local instance of Backstage in your browser, otherwise open one of the URLs printed in the terminal. \n", "confidence": [0.7051476008015234]}, {"excerpt": "Code of Conduct - This is how we roll \n", "confidence": [0.7016641425216155]}, "Backstage is an open platform for building developer portals"], "citation": [], "installation": [{"excerpt": "To run the Backstage frontend, you will need to have the following installed: \n", "confidence": [0.8092673522077345]}, {"excerpt": "$ yarn install # may take a while \n", "confidence": [0.8043699926772143]}, {"excerpt": "Run the following commands if you have Docker environment \n", "confidence": [0.7492659152345454]}], "invocation": [{"excerpt": "Project roadmap \n", "confidence": [0.7077931832335508]}, {"excerpt": "$ docker build . -t spotify/backstage \n$ docker run --rm -it -p 80:80 spotify/backstage \nThen open http://localhost/ on your browser. \n", "confidence": [0.7822657362524993, 0.7456430746147672, 0.715920106406855]}], "name": "GitHub Data", "owner": "Spotify", "license": {"name": "Apache License 2.0", "url": "https://api.github.com/licenses/apache-2.0"}, "forks_url": "https://api.github.com/repos/spotify/backstage/forks", "topics": ["infrastructure", "dx", "developer-experience", "developer-portal", "platform", "service-catalog"], "languages": ["TypeScript", "JavaScript", "HTML", "Dockerfile"], "readme_url": "https://github.com/spotify/backstage/blob/master/README.md", "releases": []}